leetcode_2451_odd_string_difference.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 2451. Odd String Difference</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 2451. Odd String Difference</h1>

<div id="outline-container-orgb7d7c10" class="outline-2">
<h2 id="orgb7d7c10">Understand the problem</h2>
<div class="outline-text-2" id="text-orgb7d7c10">
<p>
Find unique element in an array.
</p>
</div>
</div>

<div id="outline-container-orgbb5c1ab" class="outline-2">
<h2 id="orgbb5c1ab">Devise a plan</h2>
<div class="outline-text-2" id="text-orgbb5c1ab">
<p>
Group elements by their transformation and return the one that is unique.  Time and space complexity are \(O(n)\).
</p>
</div>

<div id="outline-container-org1de6a1e" class="outline-3">
<h3 id="org1de6a1e">Carry out the plan</h3>
<div class="outline-text-3" id="text-org1de6a1e">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">oddString</span>(<span style="font-weight: bold;">self</span>, words: List[<span style="font-weight: bold;">str</span>]) -&gt; <span style="font-weight: bold;">str</span>:
        g = defaultdict(<span style="font-weight: bold;">list</span>)
        <span style="font-weight: bold;">for</span> w <span style="font-weight: bold;">in</span> words:
            g[<span style="font-weight: bold;">tuple</span>(<span style="font-weight: bold;">ord</span>(b) - <span style="font-weight: bold;">ord</span>(a) <span style="font-weight: bold;">for</span> a, b <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">zip</span>(w, w[1:]))].append(w)
        <span style="font-weight: bold;">for</span> v <span style="font-weight: bold;">in</span> g.values():
            <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">len</span>(v) == 1:
                <span style="font-weight: bold;">return</span> v[0]
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>